Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/atdf/ATSAME70Q21B.atdf
          </instance>
        </module>
        <module name="HSMCI" id="6449" version="R">
          <instance name="HSMCI">
            <register-group address-space="base" name="HSMCI" name-in-module="HSMCI" offset="0x40000000"/>
            <signals>
              <signal pad="PA28" function="C" group="MCCDA"/>
              <signal pad="PA25" function="D" group="MCCK"/>
              <signal pad="PA30" function="C" group="MCDA" index="0"/>
              <signal pad="PA31" function="C" group="MCDA" index="1"/>
              <signal pad="PA26" function="C" group="MCDA" index="2"/>
              <signal pad="PA27" function="C" group="MCDA" index="3"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="0"/>
              <param name="DMAC_ID_TX" value="0"/>
              <param name="INSTANCE_ID" value="18"/>
              <param name="CLOCK_ID" value="18"/>
            </parameters>
          </instance>
        </module>
        <module name="I2SC" id="11241" version="N">
          <instance name="I2SC0">
            <register-group address-space="base" name="I2SC0" name-in-module="I2SC" offset="0x4008C000"/>
            <signals>
              <signal pad="PA1" function="D" group="CK"/>
              <signal pad="PA16" function="D" group="DI" index="0"/>
              <signal pad="PA30" function="D" group="DO" index="0"/>
              <signal pad="PA0" function="D" group="MCK"/>
              <signal pad="PA15" function="D" group="WS"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="69"/>
              <param name="CLOCK_ID" value="69"/>
            </parameters>
          </instance>
          <instance name="I2SC1">
            <register-group address-space="base" name="I2SC1" name-in-module="I2SC" offset="0x40090000"/>
            <signals>
              <signal pad="PA20" function="D" group="CK"/>
              <signal pad="PE2" function="C" group="DI" index="0"/>
              <signal pad="PE1" function="C" group="DO" index="0"/>
              <signal pad="PA19" function="D" group="MCK"/>
              <signal pad="PE0" function="C" group="WS"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="70"/>
              <param name="CLOCK_ID" value="70"/>
            </parameters>
          </instance>
        </module>
        <module name="ICM" id="11105" version="H">
          <instance name="ICM">
            <register-group address-space="base" name="ICM" name-in-module="ICM" offset="0x40048000"/>
            <parameters>
              <param name="INSTANCE_ID" value="32"/>
              <param name="CLOCK_ID" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="ISI" id="6350" version="K">
          <instance name="ISI">
            <register-group address-space="base" name="ISI" name-in-module="ISI" offset="0x4004C000"/>
            <signals>
              <signal pad="PD22" function="D" group="D" index="0"/>
              <signal pad="PD21" function="D" group="D" index="1"/>
              <signal pad="PB3" function="D" group="D" index="2"/>
              <signal pad="PA9" function="B" group="D" index="3"/>
              <signal pad="PA5" function="B" group="D" index="4"/>
              <signal pad="PD11" function="D" group="D" index="5"/>
              <signal pad="PD12" function="D" group="D" index="6"/>
              <signal pad="PA27" function="D" group="D" index="7"/>
              <signal pad="PD27" function="D" group="D" index="8"/>
              <signal pad="PD28" function="D" group="D" index="9"/>
              <signal pad="PD30" function="D" group="D" index="10"/>
              <signal pad="PD31" function="D" group="D" index="11"/>
              <signal pad="PD24" function="D" group="HSYNC"/>
              <signal pad="PA24" function="D" group="PCK"/>
              <signal pad="PD25" function="D" group="VSYNC"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="59"/>
              <param name="CLOCK_ID" value="59"/>
            </parameters>
          </instance>
        </module>
        <module name="MATRIX" id="11282" version="L">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x40088000"/>
          </instance>
        </module>
        <module name="MCAN" id="11273" version="N">
          <instance name="MCAN0">
            <register-group address-space="base" name="MCAN0" name-in-module="MCAN" offset="0x40030000"/>
            <signals>
              <signal pad="PB3" function="A" group="CANRX" index="0"/>
              <signal pad="PB2" function="A" group="CANTX" index="0"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="35"/>
              <param name="CLOCK_ID" value="35"/>
            </parameters>
          </instance>
          <instance name="MCAN1">
            <register-group address-space="base" name="MCAN1" name-in-module="MCAN" offset="0x40034000"/>
            <signals>
              <signal pad="PC12" function="C" group="CANRX" index="1"/>
              <signal pad="PD28" function="B" group="CANRX" index="1"/>
              <signal pad="PC14" function="C" group="CANTX" index="1"/>
              <signal pad="PD12" function="B" group="CANTX" index="1"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="37"/>
              <param name="CLOCK_ID" value="37"/>
            </parameters>
          </instance>
        </module>
        <module name="PIO" id="11004" version="V">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0E00"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA0"/>
              <signal group="P" index="1" function="default" pad="PA1"/>
              <signal group="P" index="2" function="default" pad="PA2"/>
              <signal group="P" index="3" function="default" pad="PA3"/>
              <signal group="P" index="4" function="default" pad="PA4"/>
              <signal group="P" index="5" function="default" pad="PA5"/>
              <signal group="P" index="6" function="default" pad="PA6"/>
              <signal group="P" index="7" function="default" pad="PA7"/>
              <signal group="P" index="8" function="default" pad="PA8"/>
              <signal group="P" index="9" function="default" pad="PA9"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="26" function="default" pad="PA26"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal group="P" index="28" function="default" pad="PA28"/>
              <signal group="P" index="29" function="default" pad="PA29"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="34"/>
              <param name="INSTANCE_ID" value="10"/>
              <param name="CLOCK_ID" value="10"/>
            </parameters>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E1000"/>
            <signals>
              <signal group="P" index="32" function="default" pad="PB0"/>
              <signal group="P" index="33" function="default" pad="PB1"/>
              <signal group="P" index="34" function="default" pad="PB2"/>
              <signal group="P" index="35" function="default" pad="PB3"/>
              <signal group="P" index="36" function="default" pad="PB4"/>
              <signal group="P" index="37" function="default" pad="PB5"/>
              <signal group="P" index="38" function="default" pad="PB6"/>
              <signal group="P" index="39" function="default" pad="PB7"/>
              <signal group="P" index="40" function="default" pad="PB8"/>
              <signal group="P" index="41" function="default" pad="PB9"/>
              <signal group="P" index="44" function="default" pad="PB12"/>
              <signal group="P" index="45" function="default" pad="PB13"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="11"/>
              <param name="CLOCK_ID" value="11"/>
            </parameters>
          </instance>
