Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/atdf/ATSAME70Q21B.atdf
        <register caption="Screening Type 2 Compare Word 1 Register (index = 6)" name="GMAC_ST2CW16" offset="0x734" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW16__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 7)" name="GMAC_ST2CW07" offset="0x738" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 7)" name="GMAC_ST2CW17" offset="0x73C" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW17__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 8)" name="GMAC_ST2CW08" offset="0x740" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 8)" name="GMAC_ST2CW18" offset="0x744" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW18__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 9)" name="GMAC_ST2CW09" offset="0x748" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 9)" name="GMAC_ST2CW19" offset="0x74C" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW19__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 10)" name="GMAC_ST2CW010" offset="0x750" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 10)" name="GMAC_ST2CW110" offset="0x754" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW110__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 11)" name="GMAC_ST2CW011" offset="0x758" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 11)" name="GMAC_ST2CW111" offset="0x75C" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW111__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 12)" name="GMAC_ST2CW012" offset="0x760" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 12)" name="GMAC_ST2CW112" offset="0x764" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW112__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 13)" name="GMAC_ST2CW013" offset="0x768" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 13)" name="GMAC_ST2CW113" offset="0x76C" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW113__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 14)" name="GMAC_ST2CW014" offset="0x770" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register (index = 14)" name="GMAC_ST2CW114" offset="0x774" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW114__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register (index = 15)" name="GMAC_ST2CW015" offset="0x778" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
