Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/atdf/ATSAME70Q21B.atdf
        <register caption="Receive Compare 0 Register" name="SSC_RC0R" offset="0x38" rw="RW" size="4">
          <bitfield caption="Receive Compare Data 0" mask="0x0000FFFF" name="CP0"/>
        </register>
        <register caption="Receive Compare 1 Register" name="SSC_RC1R" offset="0x3C" rw="RW" size="4">
          <bitfield caption="Receive Compare Data 1" mask="0x0000FFFF" name="CP1"/>
        </register>
        <register caption="Status Register" name="SSC_SR" offset="0x40" rw="R" size="4">
          <bitfield caption="Transmit Ready" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="Transmit Empty" mask="0x00000002" name="TXEMPTY"/>
          <bitfield caption="Receive Ready" mask="0x00000010" name="RXRDY"/>
          <bitfield caption="Receive Overrun" mask="0x00000020" name="OVRUN"/>
          <bitfield caption="Compare 0" mask="0x00000100" name="CP0"/>
          <bitfield caption="Compare 1" mask="0x00000200" name="CP1"/>
          <bitfield caption="Transmit Sync" mask="0x00000400" name="TXSYN"/>
          <bitfield caption="Receive Sync" mask="0x00000800" name="RXSYN"/>
          <bitfield caption="Transmit Enable" mask="0x00010000" name="TXEN"/>
          <bitfield caption="Receive Enable" mask="0x00020000" name="RXEN"/>
        </register>
        <register caption="Interrupt Enable Register" name="SSC_IER" offset="0x44" rw="W" size="4" atomic-op="set:SSC_IMR">
          <bitfield caption="Transmit Ready Interrupt Enable" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="Transmit Empty Interrupt Enable" mask="0x00000002" name="TXEMPTY"/>
          <bitfield caption="Receive Ready Interrupt Enable" mask="0x00000010" name="RXRDY"/>
          <bitfield caption="Receive Overrun Interrupt Enable" mask="0x00000020" name="OVRUN"/>
          <bitfield caption="Compare 0 Interrupt Enable" mask="0x00000100" name="CP0"/>
          <bitfield caption="Compare 1 Interrupt Enable" mask="0x00000200" name="CP1"/>
          <bitfield caption="Tx Sync Interrupt Enable" mask="0x00000400" name="TXSYN"/>
          <bitfield caption="Rx Sync Interrupt Enable" mask="0x00000800" name="RXSYN"/>
        </register>
        <register caption="Interrupt Disable Register" name="SSC_IDR" offset="0x48" rw="W" size="4" atomic-op="clear:SSC_IMR">
          <bitfield caption="Transmit Ready Interrupt Disable" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="Transmit Empty Interrupt Disable" mask="0x00000002" name="TXEMPTY"/>
          <bitfield caption="Receive Ready Interrupt Disable" mask="0x00000010" name="RXRDY"/>
          <bitfield caption="Receive Overrun Interrupt Disable" mask="0x00000020" name="OVRUN"/>
          <bitfield caption="Compare 0 Interrupt Disable" mask="0x00000100" name="CP0"/>
          <bitfield caption="Compare 1 Interrupt Disable" mask="0x00000200" name="CP1"/>
          <bitfield caption="Tx Sync Interrupt Enable" mask="0x00000400" name="TXSYN"/>
          <bitfield caption="Rx Sync Interrupt Enable" mask="0x00000800" name="RXSYN"/>
        </register>
        <register caption="Interrupt Mask Register" name="SSC_IMR" offset="0x4C" rw="R" size="4" atomic-op="read:SSC_IMR">
          <bitfield caption="Transmit Ready Interrupt Mask" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="Transmit Empty Interrupt Mask" mask="0x00000002" name="TXEMPTY"/>
          <bitfield caption="Receive Ready Interrupt Mask" mask="0x00000010" name="RXRDY"/>
          <bitfield caption="Receive Overrun Interrupt Mask" mask="0x00000020" name="OVRUN"/>
          <bitfield caption="Compare 0 Interrupt Mask" mask="0x00000100" name="CP0"/>
          <bitfield caption="Compare 1 Interrupt Mask" mask="0x00000200" name="CP1"/>
          <bitfield caption="Tx Sync Interrupt Mask" mask="0x00000400" name="TXSYN"/>
          <bitfield caption="Rx Sync Interrupt Mask" mask="0x00000800" name="RXSYN"/>
        </register>
        <register caption="Write Protection Mode Register" name="SSC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="SSC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="SSC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="SSC_RCMR__CKS">
        <value caption="Divided Clock" name="MCK" value="0x0"/>
        <value caption="TK Clock signal" name="TK" value="0x1"/>
        <value caption="RK pin" name="RK" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_RCMR__CKO">
        <value caption="None, RK pin is an input" name="NONE" value="0x0"/>
        <value caption="Continuous Receive Clock, RK pin is an output" name="CONTINUOUS" value="0x1"/>
        <value caption="Receive Clock only during data transfers, RK pin is an output" name="TRANSFER" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_RCMR__CKG">
        <value caption="None" name="CONTINUOUS" value="0x0"/>
        <value caption="Receive Clock enabled only if RF Low" name="EN_RF_LOW" value="0x1"/>
        <value caption="Receive Clock enabled only if RF High" name="EN_RF_HIGH" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_RCMR__START">
        <value caption="Continuous, as soon as the receiver is enabled, and immediately after the end of transfer of the previous data." name="CONTINUOUS" value="0x0"/>
        <value caption="Transmit start" name="TRANSMIT" value="0x1"/>
        <value caption="Detection of a low level on RF signal" name="RF_LOW" value="0x2"/>
        <value caption="Detection of a high level on RF signal" name="RF_HIGH" value="0x3"/>
        <value caption="Detection of a falling edge on RF signal" name="RF_FALLING" value="0x4"/>
        <value caption="Detection of a rising edge on RF signal" name="RF_RISING" value="0x5"/>
        <value caption="Detection of any level change on RF signal" name="RF_LEVEL" value="0x6"/>
        <value caption="Detection of any edge on RF signal" name="RF_EDGE" value="0x7"/>
        <value caption="Compare 0" name="CMP_0" value="0x8"/>
      </value-group>
      <value-group caption="" name="SSC_RFMR__FSOS">
        <value caption="None, RF pin is an input" name="NONE" value="0x0"/>
        <value caption="Negative Pulse, RF pin is an output" name="NEGATIVE" value="0x1"/>
        <value caption="Positive Pulse, RF pin is an output" name="POSITIVE" value="0x2"/>
        <value caption="Driven Low during data transfer, RF pin is an output" name="LOW" value="0x3"/>
        <value caption="Driven High during data transfer, RF pin is an output" name="HIGH" value="0x4"/>
        <value caption="Toggling at each start of data transfer, RF pin is an output" name="TOGGLING" value="0x5"/>
      </value-group>
      <value-group caption="" name="SSC_RFMR__FSEDGE">
        <value caption="Positive Edge Detection" name="POSITIVE" value="0"/>
        <value caption="Negative Edge Detection" name="NEGATIVE" value="1"/>
      </value-group>
      <value-group caption="" name="SSC_TCMR__CKS">
        <value caption="Divided Clock" name="MCK" value="0x0"/>
        <value caption="RK Clock signal" name="RK" value="0x1"/>
        <value caption="TK pin" name="TK" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_TCMR__CKO">
        <value caption="None, TK pin is an input" name="NONE" value="0x0"/>
        <value caption="Continuous Transmit Clock, TK pin is an output" name="CONTINUOUS" value="0x1"/>
        <value caption="Transmit Clock only during data transfers, TK pin is an output" name="TRANSFER" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_TCMR__CKG">
        <value caption="None" name="CONTINUOUS" value="0x0"/>
        <value caption="Transmit Clock enabled only if TF Low" name="EN_TF_LOW" value="0x1"/>
        <value caption="Transmit Clock enabled only if TF High" name="EN_TF_HIGH" value="0x2"/>
      </value-group>
      <value-group caption="" name="SSC_TCMR__START">
        <value caption="Continuous, as soon as a word is written in the SSC_THR (if Transmit is enabled), and immediately after the end of transfer of the previous data" name="CONTINUOUS" value="0x0"/>
        <value caption="Receive start" name="RECEIVE" value="0x1"/>
        <value caption="Detection of a low level on TF signal" name="TF_LOW" value="0x2"/>
        <value caption="Detection of a high level on TF signal" name="TF_HIGH" value="0x3"/>
        <value caption="Detection of a falling edge on TF signal" name="TF_FALLING" value="0x4"/>
        <value caption="Detection of a rising edge on TF signal" name="TF_RISING" value="0x5"/>
        <value caption="Detection of any level change on TF signal" name="TF_LEVEL" value="0x6"/>
        <value caption="Detection of any edge on TF signal" name="TF_EDGE" value="0x7"/>
      </value-group>
      <value-group caption="" name="SSC_TFMR__FSOS">
        <value caption="None, TF pin is an input" name="NONE" value="0x0"/>
        <value caption="Negative Pulse, TF pin is an output" name="NEGATIVE" value="0x1"/>
        <value caption="Positive Pulse, TF pin is an output" name="POSITIVE" value="0x2"/>
        <value caption="Driven Low during data transfer" name="LOW" value="0x3"/>
        <value caption="Driven High during data transfer" name="HIGH" value="0x4"/>
        <value caption="Toggling at each start of data transfer" name="TOGGLING" value="0x5"/>
      </value-group>
